{
    "washerwoman": "Washerwoman (Townsfolk) - You start knowing that 1 of 2 players is a particular Townsfolk.",
    "librarian": "Librarian (Townsfolk) - You start knowing that 1 of 2 players is a particular Outsider. (Or that zero are in play.)",
    "investigator": "Investigator (Townsfolk) - You start knowing that 1 of 2 players is a particular Minion.",
    "chef": "Chef (Townsfolk) - You start knowing how many pairs of evil players there are.",
    "empath": "Empath (Townsfolk) - Each night, you learn how many of your 2 alive neighbors are evil.",
    "fortune teller": "Fortune Teller (Townsfolk) - Each night, choose 2 players: you learn if either is a Demon. There is a good player that registers as a Demon to you.",
    "undertaker": "Undertaker (Townsfolk) - Each night*, you learn which character died by execution today.",
    "monk": "Monk (Townsfolk) - Each night*, choose a player (not yourself): they are safe from the Demon tonight.",
    "ravenkeeper": "Ravenkeeper (Townsfolk) - If you die at night, you are woken to choose a player: you learn their character.",
    "virgin": "Virgin (Townsfolk) - The 1st time you are nominated, if the nominator is a Townsfolk, they are executed immediately.",
    "slayer": "Slayer (Townsfolk) - Once per game, during the day, publicly choose a player: if they are the Demon, they die.",
    "soldier": "Soldier (Townsfolk) - You are safe from the Demon.",
    "mayor": "Mayor (Townsfolk) - If only 3 players live & no execution occurs, your team wins. If you die at night, another player might die instead.",
    "butler": "Butler (Outsider) - Each night, choose a player (not yourself): tomorrow, you may only vote if they are voting too.",
    "drunk": "Drunk (Outsider) - You do not know you are the Drunk. You think you are a Townsfolk character, but you are not.",
    "recluse": "Recluse (Outsider) - You might register as evil & as a Minion or Demon, even if dead.",
    "saint": "Saint (Outsider) - If you die by execution, your team loses.",
    "poisoner": "Poisoner (Minion) - Each night, choose a player: they are poisoned tonight and tomorrow day.",
    "spy": "Spy (Minion) - Each night, you see the Grimoire. You might register as good & as a Townsfolk or Outsider, even if dead.",
    "scarlet woman": "Scarlet Woman (Minion) - If there are 5 or more players alive & the Demon dies, you become the Demon. (Travellers don’t count)",
    "baron": "Baron (Minion) - There are extra Outsiders in play. [+2 Outsiders]",
    "imp": "Imp (Demon) - Each night*, choose a player: they die. If you kill yourself this way, a Minion becomes the Imp.",
    "bureaucrat": "Bureaucrat (Traveler) - Each night, choose a player (not yourself): their vote counts as 3 votes tomorrow.",
    "thief": "Thief (Traveler) - Each night, choose a player (not yourself): their vote counts negatively tomorrow.",
    "gunslinger": "Gunslinger (Traveler) - Each day, after the 1st vote has been tallied, you may choose a player that voted: they die.",
    "scapegoat": "Scapegoat (Traveler) - If a player of your alignment is executed, you might be executed instead.",
    "beggar": "Beggar (Traveler) - You must use a vote token to vote. If a dead player gives you theirs, you learn their alignment. You are sober & healthy.",
    "grandmother": "Grandmother (Townsfolk) - You start knowing a good player & their character. If the Demon kills them, you die too.",
    "sailor": "Sailor (Townsfolk) - Each night, choose an alive player: either you or they are drunk until dusk. You can't die.",
    "chambermaid": "Chambermaid (Townsfolk) - Each night, choose 2 alive players (not yourself): you learn how many woke tonight due to their ability.",
    "exorcist": "Exorcist (Townsfolk) - Each night*, choose a player (different to last night): the Demon, if chosen, learns who you are then doesn't wake tonight.",
    "innkeeper": "Innkeeper (Townsfolk) - Each night*, choose 2 players: they can't die tonight, but 1 is drunk until dusk.",
    "gambler": "Gambler (Townsfolk) - Each night*, choose a player & guess their character: if you guess wrong, you die.",
    "gossip": "Gossip (Townsfolk) - Each day, you may make a public statement. Tonight, if it was true, a player dies.",
    "courtier": "Courtier (Townsfolk) - Once per game, at night, choose a character: they are drunk for 3 nights & 3 days.",
    "professor": "Professor (Townsfolk) - Once per game, at night*, choose a dead player: if they are a Townsfolk, they are resurrected.",
    "minstrel": "Minstrel (Townsfolk) - When a Minion dies by execution, all other players (except Travellers) are drunk until dusk tomorrow.",
    "tea lady": "Tea Lady (Townsfolk) - If both your alive neighbors are good, they can't die.",
    "pacifist": "Pacifist (Townsfolk) - Executed good players might not die.",
    "fool": "Fool (Townsfolk) - The first time you die, you don't.",
    "tinker": "Tinker (Outsider) - You might die at any time.",
    "moonchild": "Moonchild (Outsider) - When you learn that you died, publicly choose 1 alive player. Tonight, if it was a good player, they die.",
    "goon": "Goon (Outsider) - Each night, the 1st player to choose you with their ability is drunk until dusk. You become their alignment.",
    "lunatic": "Lunatic (Outsider) - You think you are a Demon, but you are not. The Demon knows who you are & who you choose at night.",
    "godfather": "Godfather (Minion) - You start knowing which Outsiders are in play. If 1 died today, choose a player tonight: they die. [-1 or +1 Outsider]",
    "devil's advocate": "Devil's Advocate (Minion) - Each night, choose a living player (different to last night): if executed tomorrow, they don't die.",
    "assassin": "Assassin (Minion) - Once per game, at night*, choose a player: they die, even if for some reason they could not.",
    "mastermind": "Mastermind (Minion) - If the Demon dies by execution (ending the game), play for 1 more day. If a player is then executed, their team loses.",
    "zombuul": "Zombuul (Demon) - Each night*, if no-one died today, choose a player: they die. The 1st time you die, you live but register as dead.",
    "pukka": "Pukka (Demon) - Each night, choose a player: they are poisoned. The previously poisoned player dies then becomes healthy.",
    "shabaloth": "Shabaloth (Demon) - Each night*, choose 2 players: they die. A dead player you chose last night might be regurgitated.",
    "po": "Po (Demon) - Each night*, you may choose a player: they die. If your last choice was no-one, choose 3 players tonight.",
    "apprentice": "Apprentice (Traveler) - On your 1st night, you gain a Townsfolk ability (if good), or a Minion ability (if evil).",
    "matron": "Matron (Traveler) - Each day, you may choose up to 3 sets of 2 players to swap seats. Players may not leave their seats to talk in private.",
    "judge": "Judge (Traveler) - Once per game, if another player nominated, you may choose to force the current execution to pass or fail.",
    "bishop": "Bishop (Traveler) - Only the Storyteller can nominate. At least 1 opposite player must be nominated each day.",
    "voudon": "Voudon (Traveler) - Only you and the dead can vote. They don't need a vote token to do so. A 50% majority is not required.",
    "clockmaker": "Clockmaker (Townsfolk) - You start knowing how many steps from the Demon to its nearest Minion.",
    "dreamer": "Dreamer (Townsfolk) - Each night, choose a player (not yourself or Travellers): you learn 1 good and 1 evil character, 1 of which is correct.",
    "snake charmer": "Snake Charmer (Townsfolk) - Each night, choose an alive player: a chosen Demon swaps characters & alignments with you & is then poisoned.",
    "mathematician": "Mathematician (Townsfolk) - Each night, you learn how many players’ abilities worked abnormally (since dawn) due to another character's ability.",
    "flowergirl": "Flowergirl (Townsfolk) - Each night*, you learn if a Demon voted today.",
    "town crier": "Town Crier (Townsfolk) - Each night*, you learn if a Minion nominated today.",
    "oracle": "Oracle (Townsfolk) - Each night*, you learn how many dead players are evil.",
    "savant": "Savant (Townsfolk) - Each day, you may visit the Storyteller to learn 2 things in private: 1 is true & 1 is false.",
    "seamstress": "Seamstress (Townsfolk) - Once per game, at night, choose 2 players (not yourself): you learn if they are the same alignment.",
    "philosopher": "Philosopher (Townsfolk) - Once per game, at night, choose a good character: gain that ability. If this character is in play, they are drunk.",
    "artist": "Artist (Townsfolk) - Once per game, during the day, privately ask the Storyteller any yes/no question.",
    "juggler": "Juggler (Townsfolk) - On your 1st day, publicly guess up to 5 players' characters. That night, you learn how many you got correct.",
    "sage": "Sage (Townsfolk) - If the Demon kills you, you learn that it is 1 of 2 players.",
    "mutant": "Mutant (Outsider) - If you are “mad” about being an Outsider, you might be executed.",
    "sweetheart": "Sweetheart (Outsider) - When you die, 1 player is drunk from now on.",
    "barber": "Barber (Outsider) - If you died today or tonight, the Demon may choose 2 players (not another Demon) to swap characters.",
    "klutz": "Klutz (Outsider) - When you learn that you died, publicly choose 1 alive player: if they are evil, your team loses.",
    "evil twin": "Evil Twin (Minion) - You & an opposing player know each other. If the good player is executed, evil wins. Good can't win if you both live.",
    "witch": "Witch (Minion) - Each night, choose a player: if they nominate tomorrow, they die. If just 3 players live, you lose this ability.",
    "cerenovus": "Cerenovus (Minion) - Each night, choose a player & a good character: they are “mad” they are this character tomorrow, or might be executed.",
    "pit-hag": "Pit-Hag (Minion) - Each night*, choose a player & a character they become (if not-in-play). If a Demon is made, deaths tonight are arbitrary.",
    "fang gu": "Fang Gu (Demon) - Each night*, choose a player: they die. The 1st Outsider this kills becomes an evil Fang Gu & you die instead. [+1 Outsider]",
    "vigormortis": "Vigormortis (Demon) - Each night*, choose a player: they die. Minions you kill keep their ability & poison 1 Townsfolk neighbor. [-1 Outsider]",
    "no dashii": "No Dashii (Demon) - Each night*, choose a player: they die. Your 2 Townsfolk neighbors are poisoned.",
    "vortox": "Vortox (Demon) - Each night*, choose a player: they die. Townsfolk abilities yield false info. Each day, if no-one is executed, evil wins.",
    "barista": "Barista (Traveler) - Each night, until dusk, 1) a player becomes sober, healthy and gets true info, or 2) their ability works twice. They learn which.",
    "harlot": "Harlot (Traveler) - Each night*, choose a living player: if they agree, you learn their character, but you both might die.",
    "butcher": "Butcher (Traveler) - Each day, after the 1st execution, you may nominate again.",
    "bone collector": "Bone Collector (Traveler) - Once per game, at night, choose a dead player: they regain their ability until dusk.",
    "deviant": "Deviant (Traveler) - If you were funny today, you cannot die by exile.",
    "noble": "Noble (Townsfolk) - You start knowing 3 players, 1 and only 1 of which is evil.",
    "bounty hunter": "Bounty Hunter (Townsfolk) - You start knowing 1 evil player. If the player you know dies, you learn another evil player tonight. [1 Townsfolk is evil]",
    "pixie": "Pixie (Townsfolk) - You start knowing 1 in-play Townsfolk. If you were mad that you were this character, you gain their ability when they die.",
    "general": "General (Townsfolk) - Each night, you learn which alignment the Storyteller believes is winning: good, evil, or neither.",
    "preacher": "Preacher (Townsfolk) - Each night, choose a player: a Minion, if chosen, learns this. All chosen Minions have no ability.",
    "king": "King (Townsfolk) - Each night, if the dead outnumber the living, you learn 1 alive character. The Demon knows who you are.",
    "balloonist": "Balloonist (Townsfolk) - Each night, you learn 1 player of each character type, until there are no more types to learn. [+1 Outsider]",
    "cult leader": "Cult Leader (Townsfolk) - Each night, you become the alignment of an alive neighbor. If all good players choose to join your cult, your team wins.",
    "lycanthrope": "Lycanthrope (Townsfolk) - Each night*, choose a living player: if good, they die, but they are the only player that can die tonight.",
    "amnesiac": "Amnesiac (Townsfolk) - You do not know what your ability is. Each day, privately guess what it is: you learn how accurate you are.",
    "nightwatchman": "Nightwatchman (Townsfolk) - Once per game, at night, choose a player: they learn who you are.",
    "engineer": "Engineer (Townsfolk) - Once per game, at night, choose which Minions or which Demon is in play.",
    "fisherman": "Fisherman (Townsfolk) - Once per game, during the day, visit the Storyteller for some advice to help your team win.",
    "huntsman": "Huntsman (Townsfolk) - Once per game, at night, choose a living player: the Damsel, if chosen, becomes a not-in-play Townsfolk. [+the Damsel]",
    "alchemist": "Alchemist (Townsfolk) - You have a not-in-play Minion ability.",
    "farmer": "Farmer (Townsfolk) - If you die at night, an alive good player becomes a Farmer.",
    "magician": "Magician (Townsfolk) - The Demon thinks you are a Minion. Minions think you are a Demon.",
    "choirboy": "Choirboy (Townsfolk) - If the Demon kills the King, you learn which player is the Demon. [+ the King]",
    "poppy grower": "Poppy Grower (Townsfolk) - Minions & Demons do not know each other. If you die, they learn who each other are that night.",
    "atheist": "Atheist (Townsfolk) - The Storyteller can break the game rules & if executed, good wins, even if you are dead. [No evil characters]",
    "cannibal": "Cannibal (Townsfolk) - You have the ability of the recently killed executee. If they are evil, you are poisoned until a good player dies by execution.",
    "snitch": "Snitch (Outsider) - Minions start knowing 3 not-in-play characters.",
    "acrobat": "Acrobat (Outsider) - Each night*, if either good living neighbor is drunk or poisoned, you die.",
    "puzzlemaster": "Puzzlemaster (Outsider) - 1 player is drunk, even if you die. If you guess (once) who it is, learn the Demon player, but guess wrong & get false info.",
    "heretic": "Heretic (Outsider) - Whoever wins, loses & whoever loses, wins, even if you are dead.",
    "damsel": "Damsel (Outsider) - All Minions know you are in play. If a Minion publicly guesses you (once), your team loses.",
    "golem": "Golem (Outsider) - You may only nominate once per game. When you do, if the nominee is not the Demon, they die.",
    "politician": "Politician (Outsider) - If you were the player most responsible for your team losing, you change alignment & win, even if dead.",
    "widow": "Widow (Minion) - On your 1st night, look at the Grimoire and choose a player: they are poisoned. 1 good player knows a Widow is in play.",
    "fearmonger": "Fearmonger (Minion) - Each night, choose a player. If you nominate & execute them, their team loses. All players know if you choose a new player.",
    "psychopath": "Psychopath (Minion) - Each day, before nominations, you may publicly choose a player: they die. If executed, you only die if you lose roshambo.",
    "goblin": "Goblin (Minion) - If you publicly claim to be the Goblin when nominated & are executed that day, your team wins.",
    "mezepheles": "Mezepheles (Minion) - You start knowing a secret word. The 1st good player to say this word becomes evil that night.",
    "marionette": "Marionette (Minion) - You think you are a good character but you are not. The Demon knows who you are. [You neighbor the Demon]",
    "boomdandy": "Boomdandy (Minion) - If you are executed, all but 3 players die. 1 minute later, the player with the most players pointing at them dies.",
    "lil' monsta": "Lil' Monsta (Demon) - Each night, Minions choose who babysits Lil' Monsta's token & \"is the Demon\". A player dies each night*. [+1 Minion]",
    "lleech": "Lleech (Demon) - Each night*, choose a player: they die. You start by choosing an alive player: they are poisoned - you die if & only if they die.",
    "al-hadikhia": "Al-Hadikhia (Demon) - Each night*, choose 3 players (all players learn who): each silently chooses to live or die, but if all live, all die.",
    "legion": "Legion (Demon) - Each night*, a player might die. Executions fail if only evil voted. You register as a Minion too. [Most players are Legion]",
    "leviathan": "Leviathan (Demon) - If more than 1 good player is executed, evil wins. All players know you are in play. After day 5, evil wins.",
    "riot": "Riot (Demon) - Nominees die, but may nominate again immediately (on day 3, they must). After day 3, evil wins. [All Minions are Riot]",
    "gangster": "Gangster (Traveler) - Once per day, you may choose to kill an alive neighbor, if your other alive neighbor agrees.",
    "organ grinder": "Organ Grinder (Minion) - All players keep their eyes closed when voting & the vote tally is secret. Votes for you only count if you vote.",
    "vizier": "Vizier (Minion) - All players know who you are. You can not die during the day. If good voted, you may choose to execute immediately.",
    "knight": "Knight (Townsfolk) - You start knowing 2 players that are not the Demon.",
    "steward": "Steward (Townsfolk) - You start knowing 1 good player.",
    "high priestess": "High Priestess (Townsfolk) - Each night, learn which player the Storyteller believes you should talk to most.",
    "harpy": "Harpy (Minion) - Each night, choose 2 players: tomorrow, the 1st player is mad that the 2nd is evil, or both might die.",
    "plague doctor": "Plague Doctor (Outsider) - If you die, the Storyteller gains a not-in-play Minion ability.",
    "shugenja": "Shugenja (Townsfolk) - You start knowing if your closest evil player is clockwise or anti-clockwise. If equidistant, this info is arbitrary.",
    "ojo": "Ojo (Demon) - Each night*, choose a character: they die. If they are not in play, the Storyteller chooses who dies.",
    "hatter": "Hatter (Outsider) - If you died today or tonight, the Minion & Demon players may choose new Minion & Demon characters to be.",
    "kazali": "Kazali (Demon) - Each night*, choose a player: they die. [You choose which players are which Minions. -? to +? Outsiders]",
    "village idiot": "Village Idiot (Townsfolk) - Each night, choose a player: you learn their alignment. [+0 to +2 Village Idiots. 1 of the extras is drunk]",
    "yaggababble": "Yaggababble (Demon) - You start knowing a secret phrase. For each time you said it publicly today, a player might die.",
    "summoner": "Summoner (Minion) - You get 3 bluffs. On the 3rd night, choose a player: they become an evil Demon of your choice. [No Demon]",
    "banshee": "Banshee (Townsfolk) - If the Demon kills you, all players learn this. From now on, you may nominate twice per day and vote twice per nomination.",
    "doomsayer": "Doomsayer (Fabled) - If 4 or more players live, each living player may publicly choose (once per game) that a player of their own alignment dies.",
    "angel": "Angel (Fabled) - Something bad might happen to whoever is most responsible for the death of a new player.",
    "buddhist": "Buddhist (Fabled) - For the first 2 minutes of each day, veteran players may not talk.",
    "hell's librarian": "Hell's Librarian (Fabled) - Something bad might happen to whoever talks when the Storyteller has asked for silence.",
    "revolutionary": "Revolutionary (Fabled) - 2 neighboring players are known to be the same alignment. Once per game, 1 of them registers falsely.",
    "fiddler": "Fiddler (Fabled) - Once per game, the Demon secretly chooses an opposing player: all players choose which of these 2 players win.",
    "toymaker": "Toymaker (Fabled) - The Demon may choose not to attack & must do this at least once per game. Evil players get normal starting info.",
    "fibbin": "Fibbin (Fabled) - Once per game, 1 good player might get incorrect information.",
    "duchess": "Duchess (Fabled) - Each day, 3 players may choose to visit you. At night*, each visitor learns how many visitors are evil, but 1 gets false info.",
    "sentinel": "Sentinel (Fabled) - There might be 1 extra or 1 fewer Outsider in play.",
    "spirit of ivory": "Spirit of Ivory (Fabled) - There can't be more than 1 extra evil player.",
    "djinn": "Djinn (Fabled) - Use the Djinn's special rule. All players know what it is.",
    "storm catcher": "Storm Catcher (Fabled) - Name a good character. If in play, they can only die by execution, but evil players learn which player it is.",
    "gardener": "Gardener (Fabled) - The Storyteller assigns 1 or more players' characters.",
    "bootlegger": "Bootlegger (Fabled) - This script has homebrew characters or rules.",
    "ferryman": "Ferryman (Fabled) - On the final day, all dead players regain their vote token.",
    "archivist": "Archivist (Townsfolk) - Each day, you may visit the Storyteller & privately ask a yes/no question about the Demon's ability.",
    "astronomer": "Astronomer (Townsfolk) - Once per game, during the day, visit the Storyteller to privately learn why they made a decision, but not what it was.",
    "au’wre": "Au’Wre (Demon) - Each night*, guess your Minions: learn which are correct. If all are, good learns this, and must kill evil today or lose. [Evil don’t learn each other]",
    "beachcomber": "Beachcomber (Townsfolk) - Each day, visit the Storyteller to learn a fact no other on-script Townsfolk could learn with their ability.",
    "cardinal": "Cardinal (Outsider) - If nominated, tonight, you become the alignment opposite to whoever nominated you.",
    "cawthane": "Cawthane (Demon) - Each night*, choose a player: they die. [+0 or +1 Outsiders, Minions choose who you are.]",
    "cryptid": "Cryptid (Minion) - You only know part of your ability. 1 good player knows the rest of it.",
    "deserter": "Deserter (Outsider) - The 1st time a dead player votes, become their alignment tonight.",
    "esper": "Esper (Minion) - Each night (even when dead), you see the Grimoire, then choose 1 character, 1 reminder & 1 player: the Demon is shown all 3. ",
    "executioner": "Executioner (Minion) - Once per game, at night*, choose 0, 1, or 2: exactly that many players will die tonight (the Storyteller decides who).",
    "falconer": "Falconer (Townsfolk) - On your 1st night, choose a character. 1-4 nights later, learn who that character is (or that it's not in play, then choose another.",
    "fencer": "Fencer (Townsfolk) - The Demon attacks on the 1st night, but its’ victims die 1 night later. Each night, you learn who the Demon chose.",
    "firebrand": "Firebrand (Townsfolk) - If you nominate & execute the first person executed, that night (even if dead), choose a player: learn their character.",
    "grandmaster": "Grandmaster (Townsfolk) - Once per game, visit the Storyteller to privately learn who your most important ally is, but not why they're important.",
    "huli jing": "Huli Jing (Minion) - You start knowing 5 out-of-play characters. Each night, choose 1 of them: until dusk, gain its’ ability & you might register as it would.",
    "inysyns": "Inysyns (Demon) - You start knowing a day. On that day (from dawn to dusk) if good would win, evil wins instead. Each night*, choose a player: they die.",
    "ketos": "Ketos (Demon) - After the 6th day, everyone else dies. Each night*, guess a player & a good character: if right, the end comes one day sooner.",
    "local hero": "Local Hero (Townsfolk) - You start knowing an in-play opposing character. If an evil ability kills you, that character dies too.",
    "miasma": "Miasma (Minion) - Once per game, at night, choose that all Townsfolk are poisoned & get false information until dusk.",
    "mouldwarp": "Mouldwarp (Minion) - On your 1st night, become an out-of-play Demon with this ability. Demons only wake to kill every other night (even if dead).",
    "obscrul": "Obscrul (Demon) - Only you know what your ability is. Once per game, the Archivist may publicly guess it: if right, you die. [+the Archivist]",
    "occultist": "Occultist (Outsider) - You might be executed unless you are mad about learning something new every day. Once per game, when you visit the Storyteller, you learn a fact.",
    "penitent": "Penitent (Outsider) - If you died today or tonight, the Demon may change their ability to \"Each night*, choose 2 players: they die.\"",
    "perfumer": "Perfumer (Outsider) - The 1st time an evil player is nominated & executed by another evil player, their Townsfolk neighbors are poisoned (even if dead).",
    "prankster": "Prankster (Townsfolk) - Each night*, choose a player: if a Minion, their ability becomes \"Each night, choose a player: the Demon learns their character.\"",
    "silversmith": "Silversmith (Townsfolk) - On the final day, you decide who is executed (everyone learns this). If you die at night, another player might die instead.",
    "sleepwalker": "Sleepwalker (Outsider) - You think you’re a Townsfolk, but you have a different ability with the same choices. 1 good player knows you’re in play.",
    "spice trader": "Spice Trader (Townsfolk) - Each night*, learn how many evil players voted today. If you would learn a 0, you become drunk.",
    "steeplejack": "Steeplejack (Townsfolk) - If you die at night, you are woken to choose 2 \"You start knowing\" characters & get their info.",
    "surgeon": "Surgeon (Townsfolk) - Twice per game, at night*, you may choose a living player: they live if they would die, and vice versa. The Demon cannot die this way.",
    "tactician": "Tactician (Townsfolk) - Each night*, choose 2 living players: learn which one the Storyteller thinks it’d be better for the Demon to kill tonight.",
    "terminus": "Terminus (Demon) - Each night*, choose a player: they die. On the final day, the nominee with the least votes is executed instead.",
    "visionary": "Visionary (Minion) - You & a good player start knowing a question. Once per game, publicly answer it: if correct, your team wins.",
    "warden": "Warden (Townsfolk) - Once per game, at night*, choose 1 player for each on-script Demon: they are safe from that Demon.",
    "weaver": "Weaver (Townsfolk) - You start knowing 2 players: 1 of them learned something true about the other tonight.",
    "wight": "Wight (Minion) - The 1st player you nominated while alive and voted for while dead are poisoned (even when dead).",
    "scrounger": "Scrounger (Townsfolk) - Once per game, during the day, visit the Storyteller & choose a player: learn a true statement. If they’re evil, it’s false instead.",
    "insomniac": "Insomniac (Townsfolk) - You start knowing the nearest “Each night” character (not the Demon), or that none are in play.",
    "huntress": "Huntress (Townsfolk) - You start knowing the nearest Minion character & whether it’s clockwise or anticlockwise from you.",
    "teacher": "Teacher (Townsfolk) - You start knowing the nearest “Once per game” character (not the Demon), or that none are in play.",
    "tax collector": "Tax Collector (Townsfolk) - You start knowing 2 in-play characters, then choose a night*. If you haven't nominated 1 of those characters by that night, you die. ",
    "vampire": "Vampire (Townsfolk) - Each night*, if no-one died yesterday, you die, then learn 1 out-of-play character for each day you survived.",
    "parvenu": "Parvenu (Townsfolk) - 1 Minion starts knowing you. Each night*, if they weren't \"mad\" about you being evil yesterday, they might die.",
    "haruspex": "Haruspex (Townsfolk) - Once per game, at night, choose a player: chosen Demons swap characters with a living Minion (if able).",
    "inventor": "Inventor (Townsfolk) - Once per game, during the day, privately design your ability: learn a condition. When met, you gain that ability.",
    "clairvoyant": "Clairvoyant (Townsfolk) - If you died last night, you may visit the Storyteller today to learn 1 fact about the Demon's bluffs.",
    "pilgrim": "Pilgrim (Townsfolk) - Each day, you may visit the Storyteller to learn a Traveller the Storyteller would like to travel in, and a hint as to why.",
    "crime writer": "Crime Writer (Townsfolk) - The Demon also has the Butler’s ability. [-the Butler]",
    "escape artist": "Escape Artist (Outsider) - Once, at dawn, you may declare that if a good player dies today, good loses, but if evil dies, you learn who the Demon is. If you died, you must.",
    "wind-viced": "Wind-Viced (Outsider) - You think you are a Minion, but you are not. [The Demon is Au'Wre]",
    "turncoat": "Turncoat (Outsider) - If you are the most “mad” about wanting to execute the Demon player, you become evil tonight & learn who the Demon is.",
    "sallow": "Sallow (Minion) - You start knowing which opposing characters are in-play. Then, choose 1 of them: they might register falsely. If they die, choose again.",
    "spectre": "Spectre (Minion) - Each night*, choose up to 2 good characters: you & the Demon register falsely to those abilities (if in play).",
    "vessel": "Vessel (Minion) - 1 Demon is marked on the script with 🕱. If the Demon dies & 5 or more non-Travelers live, become the marked Demon.",
    "wind nymph": "Wind Nymph (Minion) - You are safe from evil abilities. The 1st evil player to choose you with their ability each night swaps characters with you. [+1 Outsider] ",
    "trizkidek": "Trizkidek (Demon) - Each night*, choose 3 players: 1 is poisoned until dusk & 1 dies. If you added an Outsider, choose 1 instead. [-1 or +1 Outsider]",
    "unseelie": "Unseelie (Demon) - Each night*, choose a player: they die. Outsiders you kill register as and think they’re alive until executed. [+1 Outsider]"
}